<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>1.2__ReceiverConfiguration_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
						
<p>
							
<span id="Help_ReceiverConfiguration_1_Label">Haupt und Neben(Sub) Empf&auml;nger Konfiguration:</span>
<br>
							
<span id="Help_ReceiverConfiguration_2_Label">Haupt- und Nebenempf&auml;nger: hier k&ouml;nnen Sie Ihren Hauptempf&auml;nger und bis zu 2 weitere Empf&auml;nger als Nebenempf&auml;nger einstellen. Bitte beachten Sie, dass nur der Hauptempf&auml;nger Telemetrie-Sensor Daten zur&uuml;ck senden kann. Empf&auml;ngerspannung und Signalqualit&auml;t werden aber auch von den Nebenempf&auml;ngern &uuml;bertragen.</span>
						
</p>
						
<ul>
							
<li>
								
<p id="Help_ReceiverConfiguration_3_Label">Empf&auml;ngertyp: w&auml;hlen Sie den passenden Empf&auml;nger entsprechend Ihrem Modell. Der Empf&auml;nger wird zus&auml;tzlich als Bild angezeigt (Tiny, Clever, Smart, Micro, Gizmo).</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_4_Label">Anzeige der Firmware-Version (Firmware) des Empf&auml;ngers, wenn dieser mit dem Sender gebunden ist. Bitte kontrolieren Sie ob die Version kompatibel ist. Hierzu finden Sie auf www.weatronic.com eine ausf&uuml;hrliche Liste. Falls Sie den Empf&auml;nger updaten wollen lesen Sie bitte die entsprechende Empf&auml;nger Anleitung.</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_5_Label">Die Akku Spannung zeigt den Live-Wert der Empf&auml;nger-Stromversorgung an. Bitte stellen Sie sicher das Ihr Akku in einem perfektem Zustand ist und das dieser geladen ist bevor Sie Ihr Modell einsetzen.</p>	
							
</li>
							
<li>
								
<p>
									
<span id="Help_ReceiverConfiguration_6_Label">Akkuwarnung (Battery Warning), stellen Sie die geeignete Warnschwelle f&uuml;r den verwendeten Akku in Ihrem Modell ein. Diese Warnschwelle ist absolut Sicherheitsrelevant und wir empfehlen Ihnen diesen Wert eher konservativ zu w&auml;hlen. Die Nennspannung Ihres Akkus sollte anfangs ein guter Richtwert sein. Bitte &uuml;berpr&uuml;fen Sie Ihre Akkus vor jedem Flug und kontrollieren Sie den Ladezustand. Der Sender wird Ihnen eine Warnung ausgeben, sobald die Warnschwelle erreicht wird:</span>
<br>
									
<span id="Help_ReceiverConfiguration_7a_Label" style="padding-left: 150px;">3 x Piepton und gleichzeitige </span><span id="Help_ReceiverConfiguration_7b_Label" style="color:#f00;">rot blinkende LED</span>
								
</p>
									
<span id="Help_ReceiverConfiguration_7k_Label">Der Gizmo Empf&auml;nger hat einige zus&auml;tzliche Optionen:</span>
									
<ul>
										
<li>
											
<span id="Help_ReceiverConfiguration_7l0_Label">Akku Umschaltung Warnschwelle, wenn die Hauptbatterie Spannung (BATT 1) unter den eingestellten Schwellwert f&auml;llt wird der Gizmo-Empf&auml;nger auf den Reserve-Akku (Batt 2) umschalten, unter bestimmten Bedingungen kann dieser Vorgang einige Millisekunden dauern. Zur Stromversorgung des Empf&auml;ngers empfehlen wir, zwei identische Batterien zu verwenden:</span>
											
<ul>
												
<li id="Help_ReceiverConfiguration_7l1_Label">2 x 2S LiPo (Nennspannung 7,4V) oder </li>
												
<li id="Help_ReceiverConfiguration_7l2_Label">2 x 3S LiFe (Nennspannung 9,9V)</li>
											
</ul>	
											
<span id="Help_ReceiverConfiguration_7l4_Label">Es wird dringend empfohlen, die Umschaltschwelle folgenderma&szlig;en zu setzen:</span>
											
<ul>	
												
<li id="Help_ReceiverConfiguration_7l5_Label">6,8 Volt f&uuml;r 2S LiPo und</li>
												
<li id="Help_ReceiverConfiguration_7l6_Label">8,4 Volt f&uuml;r 3S LiFe</li>
											
</ul>
										
</li>
										
<li id="Help_ReceiverConfiguration_7m_Label">Akkutest 1 und 2 Grenzwert, bei jedem Einschalten des Empf&auml;ngers wird automatisch die Spannung der beiden angeschlossenen Akkus getestet (mit 7 Ampere f&uuml;r 0,25 Sekunden). Die Voreinstellung f&uuml;r einen maximalen Spannungsabfall liegt bei 0,3 Volt. Sollte der Spannungseinbruch h&ouml;her sein, empfehlen wir den Austausch des Akkus. Zus&auml;tzlich wird ein negativer Test visuell durch Blinken der roten LED am Empf&auml;nger und am Ein-/Ausschaltboard angezeigt.</li>
										
<li id="Help_ReceiverConfiguration_7n_Label">Test Button, hiermit simulieren Sie den Akkutest.</li>
									
</ul>
							
</li>
							
<li>
								
<p>
									
<span id="Help_ReceiverConfiguration_8_Label">Reichweiten Warnung, diese Warnschwelle gibt Ihnen die M&ouml;glichkeit eine Maximum Reichweiten Warnung einzustellen. Sobald Sie diese Schwelle &uuml;berschreiten sollten Sie Ihr Modell wieder n&auml;her zu sich bringen um eine Signalunterbrechung zu vermeiden. Der Sender wird Ihnen eine Warnung ausgeben sobald die Warnschwelle erreicht ist:</span>
<br>
									
<span id="Help_ReceiverConfiguration_9a_Label" style="padding-left: 150px;">2 x Piepton und gleichzeitige </span><span id="Help_ReceiverConfiguration_9b_Label" style="color:#f00;">rot blinkende LED</span>
								
</p>
							
</li>
							
<li>
								
<p>
									
<span id="Help_ReceiverConfiguration_10_Label">R&uuml;ckkanal Warnung, diese Warnschwelle informiert Sie &uuml;ber die Signalst&auml;rke des "R&uuml;ckkanals". Dieser "R&uuml;ckkanal" stellt alle Informationen des Empf&auml;ngers zur&uuml;ck zum Sender bereit. Hierzu z&auml;hlen die Empf&auml;nger Spannung, alle Telemetrie Sensor Werte und die Empfangsqualit&auml;t. Mit anderen Worten: sobald der "R&uuml;ckkanal" zusammenbricht ist keine R&uuml;ckmeldung vom Empf&auml;nger mehr vorhanden. Der Sender wird Ihnen eine Warnung ausgeben sobald die Warnschwelle erreicht ist:</span>
<br>
									
<span id="Help_ReceiverConfiguration_11a_Label" style="padding-left: 150px;">1 x Piepton und gleichzeitige </span><span id="Help_ReceiverConfiguration_11b_Label" style="color:#f00;">rot blinkende LED</span>
								
</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_12_Label">Failsafe Verz&ouml;gerung  sollte die Verbindung zwischen Sender und Empf&auml;nger unterbrochen werden, werden die Servos nach der hier hinterlegten Zeit im Modell in die vorher gespeicherten Positionen fahren.</p>
							
</li>
							
<li>
								
<span id="Help_ReceiverConfiguration_13a_Label">Summensignal Ausgabe, beim Standard Summensignal wird der letzte Ausgang in den weatronic Empf&auml;ngern als Summenkanal Ausgang verwendet (z.B. beim Tiny 5 ist es Ausgang 5, beim Smart 8 ist es Ausgang 8, etc.). Ebenso ist mittlerweile das weit verbreitete SRXL Protokol verf&uuml;gbar. Dieses wird aber immer an Steckplatz 1 ausgegeben.</span>
								
<ul>
									
<li id="Help_ReceiverConfiguration_13a1_Label">Standard PPM Signal</li>
									
<li id="Help_ReceiverConfiguration_13a2_Label">SRXL Multiplex 12 und SRXL Multiplex 16</li>
									
<li id="Help_ReceiverConfiguration_13a3_Label">SRXL weatronic 16</li>
								
</ul>
								
<table>
									
<tr>
										
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
										<td><span id="Help_ReceiverConfiguration_13b_Label">ANMERKUNG: Die Micro und Gizmo Empf&auml;nger haben kein Summensignal.</span></td>
									
</tr>
								
</table>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_14_Label">Summensignal w&auml;hrend des Failsafes ausschalten, w&auml;hlen Sie JA oder NEIN.</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_15_Label">Synchronisation der Servo Ansteuerung (Servo-Puls Synchron), bitte schauen Sie in das weatronic Infoblatt "Servoausgabe", welches Sie im Downloadbereich unserer Homepage (www.weatronic.com) finden. Werden die Servoimpulse synchron ausgegeben, kann es zu einer hohen Belastung der Empf&auml;ngerstromversorgung kommen. Wir empfehlen deshalb nur ausreichend starke BEC Einheiten zu verwenden.</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_16_Label">Temperatur Warnung (diese Option wird demn&auml;chst erh&auml;ltlich sein)</p>
							
</li>
							
<li>
								
<p id="Help_ReceiverConfiguration_17_Label">BINDING, mit diesem Button wird der Binding-Prozess gestartet und der Sender sucht nach einem weatronic Empf&auml;nger, der ebenfalls im Binding Modus ist. Zur Visualisierung &ouml;ffnet sich ein Hinweisfenster. Sobald der Binding Prozess erfolgreich war, verschwindet das Fenster oder wenn der Prozess manuell unterbrochen wurde (Binding Anhalten).</p>
							
</li>
						
</ul>
						
<br>
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
