<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>1.4.0__Functions_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
<p>
							
<span id="Help_Functions_1_Label">Funktionen - die weatronic Philosophie</span>
<br>
							
<span id="Help_Functions_2_Label">Mit der neuen Senderfamilie von weatronic sind Sie nicht mehr beschr&auml;nkt auf Kan&auml;le oder vordefinierte Strukturen. Die einzige Begrenzung f&uuml;r m&ouml;gliche Funktionen bildet die Anzahl der Servosteckpl&auml;tze am Empf&auml;nger! Zum Beispiel bietet Ihnen der Empf&auml;nger Gizmo 30 genau 30 Servosteckpl&auml;tze. Gem&auml;&szlig; der weatronic Philosophie ist die Programmierung in Funktionen organisiert, von denen Sie bis zu 96 f&uuml;r ein Modell programmieren k&ouml;nnen. Diese k&ouml;nnten beispielsweise Querruder, H&ouml;henruder, W&ouml;lbklappen hei&szlig;en oder einen Namen tragen, den Sie selber vergeben. &Uuml;blicherweise wird f&uuml;r die Ansteuerung jeder Funktion ein oder aerodynamischen Anforderungen. Im Men&uuml;punkt "Funktionseinstellungen" erfolgt die Feineinstellung der Funktionskurve und hat somit auf alle zugeordneten Servos die gleiche Auswirkunge. Hier haben Sie die M&ouml;glichkeit die Funktion mit Flex Rate (flexibles Dual Rate), Flex Expo (flexible Exponentialfunktion), Flex Differntial (flexible Differenzierung) und weiterer Optionen bis hin zu einer 33 Punkt Kurve zu beinflussen. (Hinweis: Um die Funktion "Differenzierung" richtig zu nutzen, sollten die Servo-Attribute wie R(echts) und L(inks) richtig eingestellt sein) Auch empfehlen wir dringend, die richtigen Failsafe Positionen f&uuml;r jede Funktion einzustellen. Besonders wichtig ist diese Einstellung f&uuml;r die Motor Funktion, um jegliche Gefahr auszuschlie&szlig;en oder zumindest gef&auml;hrliche Situationen zu vermeiden. Beim Programmieren von Modellen mit Elektromotoren sollten die Luftschrauben demontiert werden. Bei Bedarf k&ouml;nnen Sie einen Trimmgeber der Funktion zuordnen oder einen (flugphasenabh&auml;ngigen) konstanten Ausgleich hinzuf&uuml;gen (FMO = Flight Mode Offset).</span>
						
</p>
						
<p id="Help_Functions_2a_Label">Links sehen Sie die Funktionsliste und rechts sehen Sie verschiedene Symbole:</p>
						
<p id="Help_Functions_2b_Label">Es gibt 2 verschiedene Ansichten f&uuml;r dieses Men&uuml;. Die "Standard" Ansicht und die "Setup" Ansicht. Mit dem Umschaltsymbol rechts oben k&ouml;nnen Sie hin- und herschalten.</p>
						
<ul>
							
<li>
								
<p id="Help_Functions_3_Label">Um eine weitere Funktion am Ende der Liste hinzuzuf&uuml;gen ber&uuml;hren Sie das "PLUS" Symbol oben rechts. Sie erreichen die unteren Funktion indem Sie den Bildschirm nach "oben" wischen/scrollen.</p>
							
</li>
							
<li>
								
<span id="Help_Functions_4a_Label">Um eine Funktion zu l&ouml;schen tippen Sie einfach auf das "Eimer" Symbol und dann auf das "X" Symbol der jeweiligen Funktion.</span>
								
<table>
									
<tr>
										
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
										<td><span id="Help_Functions_4b_Label">ANMERKUNG:Einige Funktionen die mit Hilfe des "Setup Wizard" erstellt worden sind, k&ouml;nnen nicht gel&ouml;scht werden.</span></td>
									
</tr>
								
</table>
							
</li>
							
<li>
								
<p id="Help_Functions_4c_Label">Die "Neuanordnung einer Liste" Liste unterhalb des "Eimer" symbols hilft Ihnen die Liste nach Ihren W&uuml;nschen durch tippen auf die "rauf "runter" Pfeile anzuordnen.</p>
							
</li>
						
</ul>
						
<p id="Help_Functions_5_Label">Die Funktions Liste zeigt mehrere Spalten:</p>
						
<ul>
							
<li>
								
<p id="Help_Functions_6_Label">Funktion, tippen Sie auf den Funktionsname und &auml;ndern Sie diesen mit Hilfe des Pop-Ups.</p>
							
</li>
							
<li>
								
<p id="Help_Functions_7_Label">Setup, hier k&ouml;nnen Sie das "Flex rate" - "Flex Expo" - "Flex Differenzierung" - "Fail Safe Position" - "Verz&ouml;gerung" - "Kurven Editor" f&uuml;r die jeweilge Funktion &auml;ndern. ANMERKUNG: Diese &Auml;nderungen wirken sich nur auf die Geber Kurve aus.</p>
							
</li>
							
<li>
								
<p id="Help_Functions_8_Label">Geber, tippen Sie auf die Grafik und legen Sie bei Bedarf einen Geber f&uuml;r diese Funktion fest.</p>
							
</li>
							
<li>
								
<p id="Help_Functions_9_Label">Trimm, hier k&ouml;nnen Sie eine Trimmung festlegen und diese auch konfigurieren.</p>
							
</li>
							
<li>
								
<p id="Help_Functions_10_Label">FPO, der "Flugphasen-Offset" gibt Ihnen die M&ouml;glichkeit verschiedene "Offsets"(Abweichungen) f&uuml;r jede Funktion zu vergeben. Die obere "Informations Zeile" zeigt Ihnen die aktuellen Flugphase.</p>
							
</li>	
							
<li>
								
<p id="Help_Functions_11_Label">Servos, hier sehen Sie die Nummer der Servosteckpl&auml;tze die der Funktion zugeordnet sind. Tippen Sie darauf und Sie kommen in das Servo Zuordnungs Men&uuml; der dieser Funktion. Dort k&ouml;nnen Sie dann jedes dieser Servos einzeln verwalten.</p>
							
</li>
							
<br>
										
						
</ul>	
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
