<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>2.2.0__WiFiSettings_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
<p id="Help_WiFiSettings_1_Label">WiFi Einstellung - Mit der WiFi Option haben Sie M&ouml;glichkeit, sehr elegant &uuml;ber andere WiFi-f&auml;hige Endger&auml;te Ihre Modelle zu konfigurieren. Grunds&auml;tzlich ist das WiFi bei jedem Einschaltvorgang deaktiviert.</p>
						
<ul>
							
<li>
								
<p id="Help_WiFiSettings_2a_Label">Um die WiFi Funktionalit&auml;t zu nutzen m&uuml;ssen Sie zuerst einmal Ihren BAT Sender mit einem WiFi Netzwerk verbinden.</p>
								
<span id="Help_WiFiSettings_2b_Label">Aktivieren Sie zuerst das WiFi, in dem Sie das graue K&auml;stchen links oben ber&uuml;hren ("WiFi aktiviert"). Bitte vergewissern Sie sich zuerst, dass ein WiFi-Stick in Ihrem Sender eingebaut wurde. Dieser muss am linken, internen USB Port des Senders stecken (von unten gesehen).</span>
<br>
								
<span id="Help_WiFiSettings_2c_Label">Ber&uuml;hren Sie anschlie&szlig;end den Button "Scannen" und warten Sie einen Moment. Alle verf&uuml;gbaren Netzwerke werden in der Liste angezeigt. Sind mehrere Netzwerke verf&uuml;gbar, scrollen Sie nach unten, in dem Sie sanft mit Ihrem Finger &uuml;ber die Liste "wischen".</span>
<br>
								
<span id="Help_WiFiSettings_2d_Label">Alle bereits gespeicherten Netzwerke sind ganz oben in der Liste zu finden. Auch wenn Sie ausserhalb der Reichweite sind.</span>
<br>
								
<span id="Help_WiFiSettings_2e_Label">Das kleine WiFi Symbol zeigt Ihnen die Signalqualit&auml;t des jeweiligen Netzwerkes an.</span>
<br>
								
<span id="Help_WiFiSettings_2f_Label">Haben Sie das gew&uuml;nschte Netzwerk gefunden, ber&uuml;hren Sie die Zeile. Sie wird nun hell hinterlegt. Ber&uuml;hren Sie nun den Button "Verbinden" und die Verbindung wird aufgebaut. Melden Sie sich das erste Mal in einem Netzwerk an, &ouml;ffnet sich automatisch das WiFi-Setup.</span>
<br>
								
<span id="Help_WiFiSettings_2g_Label">Nachdem das kleine Hinweisfenster f&uuml;r den Verbindungsaufbau verschwunden ist, erscheint eine Sender IP-Adresse am unteren linken Rand.</span>
<br>
								
<span id="Help_WiFiSettings_2h_Label">Nat&uuml;rlich k&ouml;nnen Sie gespeicherte WiFi Netzwerke mit Hilfe des "Eimer" Symbol auch l&ouml;schen. Tippen Sie auf das Setup um das Passwort f&uuml;r das Netzwerk einzustellen.</span>
							
</li>
							
<li>
								
<p id="Help_WiFiSettings_3a_Label">Jedes Ger&auml;t, was in Ihrem gew&auml;hlten Netzwerk angemeldet ist, kann nun genutzt werden, um Eingaben f&uuml;r die Programmierung Ihres Senders vorzunehmen.</p>
								
<span id="Help_WiFiSettings_3b_Label">&ouml;ffnen Sie den Browser und geben Sie die IP-Adresse des Senders direkt in die Adresszeile ein. Nun best&auml;tigen Sie die Eingabe und es erscheint 1:1 der Startbildschirm Ihres Senders. Von jetzt an werden s&auml;mtliche Eingaben, die Sie dann von anderen Ger&auml;ten vornehmen, direkt im Sender vorgenommen und gespeichert.</span>
<br>
								
<span id="Help_WiFiSettings_3c_Label">Bitte beachten Sie: Jedes Ger&auml;t des Netzwerkes kann den BAT Sender unabh&auml;ngig und gleichzeitig programmieren.</span>
<br>
								
<span id="Help_WiFiSettings_3d_Label">Sie k&ouml;nnen mehr als ein Ger&auml;t gleichzeitig benutzen.</span>
							
</li>
						
</ul>
						
<table>
							
<tr>
								
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
								<td>
									<span id="Help_WiFiSettings_4a_Label">ANMERKUNG: Das WiFi befindet sich zur Zeit in einer &ouml;ffentlichen Beta-Phase. Auf Grund der Vielzahl unterschiedlicher Endger&auml;te kann es in Ausnahmef&auml;llen nicht funktionieren, was wir an dieser Stelle entschuldigen m&ouml;chten. Wir werden dies so schnell wie m&ouml;glich beheben.</span>
<br>
									
<span id="Help_WiFiSettings_4b_Label">Bitte beachten Sie auch die folgenden Hinweise f&uuml;r eine externe Programmierung des Senders:</span>
									
<ul style="margin-top: 0;">
										
<li id="Help_WiFiSettings_4c_Label">Bei einem externen Zugriff wird die Tastatur des externen Ger&auml;tes selbst genutzt.</li>
										
<li id="Help_WiFiSettings_4d_Label">Vermeiden Sie die gleichzeitige Programmierung der selben Funktion oder des selben Men&uuml;s von unterschiedlichen Ger&auml;ten.</li>
										
<li id="Help_WiFiSettings_4e_Label">Wir empfehlen Ihnen, das WiFi nach der externen Programmierung wieder zu deaktivieren. Bei der Daten&uuml;bertragung k&ouml;nnte es zu einer leichten Beeinflussung des R&uuml;ckkanals kommen.</li>
									
</ul>
								
</td>	
							
</tr>
						
</table>
						
<br>
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
