<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>1.18.0__StartupWarnings_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
<span id="Help_StartupWarnings_1_Label">Ab der Software Version 6.07 haben Sie die M&ouml;glichkeit, individuelle Startup Warnings f&uuml;r jedes einzelne Ihrer Modelle zu hinterlegen.</span>
<br>
						
<span id="Help_StartupWarnings_2_Label">Ein einfaches Beispiel w&auml;re die Warnung f&uuml;r die "Motor" Funktion. Haben Sie diese Warnung bei einem Modell hinterlegt, erhalten Sie eine optische Warnung mit dem LED-Ring, eine akkustische Warnung und die Warnung wird auf dem Display angezeigt. Diese Warnungen erhalten Sie beim Start des Senders oder wenn Sie dieses Modell im Rahmen des Modellwechsels ausw&auml;hlen. Diese Warnungen werden Ihnen helfen, dass Sie bei kritischen oder gef&auml;hrlichen Fuktionen stets die richtige Stellung der Geber einstellen. Wird das Modell eingeschaltet, ist seitens des Senders somit alles bestens vorbereitet.		Und es gibt noch mehr: Auf dieser Seite haben Sie zus&auml;tzlich die M&ouml;glichkeit, sogenannte "Preflight Checklisten" anzulegen. Sie k&ouml;nnen eine Liste erstellen, in der Sie alle Punkte eintragen, die Sie vor dem Start des Modells durchgehen (und abhaken) wollen. Diese Liste wird Ihnen zus&auml;tzlich zu den Startup-Warnings in dem Moment angezeigt, wenn Sie den Sender starten (und das Modell aktuell im Speicher ist) oder Sie im Rahmen des Modellwechsels dieses Modell ausw&auml;hlen. Die Liste, die Texte und Notizen erstellen Sie individuell.</span>
<br>
						
<span id="Help_StartupWarnings_3_Label">Die Startup-Warnings gelten nur f&uuml;r dieses ausgew&auml;hlte Modell. Die Preflight Checkliste steht Ihnen auch f&uuml;r andere Modelle zur Verf&uuml;gung. In den Preflight Checklisten k&ouml;nnen Sie w&auml;hlen, welcher Punkt bei welchem Modell abgefragt werden soll. Es k&ouml;nnen auch mehrere Checklisten von Ihnen erstellt werden. Zum Beispiel f&uuml;r Ihre Jet-Modelle, alle Segelflugzeuge oder Ihre Trucks. Sie sind der Pilot.</span>
						
<br>
						
<br>
						
<span id="Help_StartupWarnings_4_Label">Das Men&uuml; ist unterteilt in 2 Bereiche.</span>
						
<ul style="margin-top: 0px;">
							
<li>
								
<span id="Help_StartupWarnings_5_Label">Preflight Checkliste, diese Zeile zeigt die momentan f&uuml;r dieses Modell ausgew&auml;hlte Checkliste und 4 weitere Buttons.</span>
								
<ul>
									
<li id="Help_StartupWarnings_5a_Label">Klicken Sie auf das Symbol der Lupe und w&auml;hlen Sie eine Liste aus, die Sie verwenden m&ouml;chten. Sie k&ouml;nnen jedem Modell nur eine Liste zuordnen. W&auml;hlenSie die Liste durch einen DOPPELKLICK aus.</li>
									
<li id="Help_StartupWarnings_5b_Label">Klicken Sie auf das Plus-Zeichen, um eine neue Checkliste zu erstellen. Geben Sie der Liste einen passenden Namen. Sollte bereits eine Checkliste dem Modell zugeordnet sein, beachten Sie bitte, dass diese Liste durch die neue Liste ersetzt wird.</li>
									
<li id="Help_StartupWarnings_5c_Label">Durch Klick auf das Stift-Symbol kann die bestehende Liste editiert und neue Punkte hinzugef&uuml;gt werden. Bitte lesen Sie Kapitel 21.1.17.1 f&uuml;r weitere Informationen.</li>
									
<li id="Help_StartupWarnings_5d_Label">Mit Klick auf das Symbol des M&uuml;lleimers erreichen Sie, dass die momentane Checkliste beim Start oder Modellwechsel nicht mehr f&uuml;r das Modell angezeigt wird. Die Liste selber wird nicht gel&ouml;scht und steht weiterhin als Checkliste f&uuml;r andere Modelle zur Auswahl. Um die Liste endg&uuml;ltig zu l&ouml;schen nutzen Sie bitte den Dateimanager.</li>
								
</ul>
							
</li>
							
<li>
								
<span id="Help_StartupWarnings_6_Label">Startup Warnings, hier sehen Sie alle von Ihnen f&uuml;r das Modell hinterlegte Warnungen. Beim ersten Besuch des Men&uuml;s ist die Liste leer.</span>
								
<ul>
									
<li id="Help_StartupWarnings_6a_Label">Klick auf "PLUS" und es erscheint eine &Uuml;bersicht der Telemetrie-Daten, die als Warnung eingestellt werden k&ouml;nnen. Bitte w&auml;hlen Sie eine Information (z.B. eine bestimmte Funktion oder einen Servo) aus, die Sie der Liste Ihrer Startup Warnings hinzuf&uuml;gen wollen. Die ausgw&auml;hlte Information wird im Anschluss Ihrer Liste hinzugef&uuml;gt.</li>
									
<li id="Help_StartupWarnings_6b_Label">Klick auf "M&uuml;lleimer" wenn Sie Startup Warnings aus Ihrer Liste l&ouml;schen wollen.</li>
									
<li id="Help_StartupWarnings_6c_Label">Klick auf das "Auge" und Ihnen wird die Liste der Warnungen angezeigt, wie Sie diese bei einem Modellwechsel oder beim Start des Senders sehen. Bitte beachten Sie, dass in dieser Vorschau die Live Werte in der Farbe Lila angezeigt werden und nicht in gr&uuml;n und rot.</li>
									
<li>
										
<span id="Help_StartupWarnings_6d_Label">Ein neuer Eintrag in die Liste der Startup Warnungen hat mehrere Spalten:</span>
										
<ul>
											
<li id="Help_StartupWarnings_6d1_Label">Name, hier erscheint die von Ihnen gew&auml;hlte Telemetrie-Information. M&ouml;chten Sie eine andere Information, bzw. einen anderen Wert angezeigt haben, klicken Sie einfach auf dieses Feld und w&auml;hlen neu.</li>
											
<li id="Help_StartupWarnings_6d2_Label">Operator, man kann zwischen gr&ouml;&szlig;er als (&nbsp;&gt; ) und kleiner als ( &lt; ) w&auml;hlen - die Vorgabe ist gr&ouml;&szlig;er als</li>
											
<li id="Help_StartupWarnings_6d3_Label">Wert, hier stellen Sie den Grenzwert sein. Haben Sie zum Beispiel eine Motorfunktion gew&auml;hlt und bei -100% ist der Motor aus, so w&auml;hlen Sie als Operator gr&ouml;&szlig;er als (&gt;) und als Wert -96%. Wenn Sie das Modell w&auml;hlen wird also der Alarm ausgel&ouml;st, wenn die Motorfunktion gr&ouml;&szlig;ter als -96% ist.</li>
											
<li> 
												
<span id="Help_StartupWarnings_6d4_Label">Checklist, Sie k&ouml;nnen die Warnung hier mit einem Eintrag aus der vorher ausgew&auml;hlten Preflight Checkliste verbinden (aus der Checkliste, die Sie in der ersten Zeile dieses Men&uuml;s hinterlegt haben). Sobald Sie eine Verbindung vorgenommen haben, erscheint in dieser Zeile der Startup Warnung der Hinweis "Set".</span>
												
<table>
													
<tr>
														
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
														<td>
															<span id="Help_StartupWarnings_6d6_Label">ANMERKUNG: Sollten Sie die Preflight Checkliste l&ouml;schen oder wechseln, kontrollieren Sie bitte die Verkn&uuml;pfungen der Startup Warnings. Auch wenn in der Zeile der Warnungen "Set" angezeigt wird, kann die Verkn&uuml;pfung nicht mehr existieren.</span>
<br>
															
														
</td>
													
</tr>
												
</table>
											
</li>
											
										
</ul>
									
</li>
								
</ul>
							
</li>
						
</ul>
						
<br>
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
