<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>6.2__AddNewModel_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
<p id="Help_AddNewModel_1_Label">F&uuml;gen Sie Ihrem Sender ein neues Modell hinzu. In diesem Men&uuml;punkt startet ein Assistent, mit dem Sie leicht und logisch ein neues Modell hinzuf&uuml;gen k&ouml;nnen. Der Assistent f&uuml;hrt Sie durch alle Eingabem&ouml;glichkeiten. Parallel dazu liegt Ihrem Sender eine Kurzanleitung in Papierform bei, die Sie ebenfalls nutzen k&ouml;nnen.</p>
						
<p>
							
<span id="Help_AddNewModel_2_Label">W&auml;hlen Sie die Art des Modells. Die Kategorie Segler beinhaltet auch (Elektro-) Motorsegler. Boote, Autos und andere Modelle k&ouml;nnen in der Kategorie "Eigene Konfiguration" programmiert werden.</span>
<br>
							
<span id="Help_AddNewModel_3_Label">Nachdem Sie ein Modellkategorie gew&auml;hlt haben m&uuml;ssen Sie dem Modell einen Namen geben. Danach startet der eigentliche "Setup Wizard"/Assistent.</span>
						
</p>
						
<p id="Help_AddNewModel_4_Label">Hier eine kurze &Uuml;bersicht der einzelnen Schritte:</p>
						
<p id="Help_AddNewModel_5_Label">F&uuml;r detaillierte Informationen lesen Sie bitte die weatronic Kurzanleitung "Setup Wizard".</p>
						
<ul style="list-style-type:none;">
							
<li>
								
<span id="Help_AddNewModel_6_Label">Schritt 1: Modell Konfiguration - Achten Sie darauf, dass alle Einstellungen korrekt sind, da sie im Nachhinein nicht mehr ver&auml;ndert werden k&ouml;nnen, wenn man mit dem Assistenten ein neues Modell anlegt. Dazu geh&ouml;ren zum Beispiel: Voreinstellungen der Funktionen, Typ des Hecks, Anzahl der Steuerfl&auml;chen.</span>
								
<table>
									
<tr>
										
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
										<td><span id="Help_AddNewModel_7_Label">ANMERKUNGEN: Steuerfl&auml;chen sind die sich physikalisch bewegenden Klappen UND NICHT die Anzahl der Servos im Fl&uuml;gel!</span></td>
									
</tr>
								
</table>
							
</li>
							
<li>
								
<p id="Help_AddNewModel_8_Label">Schritt 2: Wahl des Modes - W&auml;hlen Sie Ihren Mode aus (Mode 1 bis 4). Selbstverst&auml;ndlich k&ouml;nnen Sie die Geber und Trimmungen f&uuml;r jede Funktion auch sp&auml;ter individuell &auml;ndern.</p>
							
</li>
							
<li>
								
<span id="Help_AddNewModel_9_Label">Schritt 3: Empf&auml;nger-Konfiguration - Hier k&ouml;nnen Sie Ihren Empf&auml;nger ausw&auml;hlen, der in dem Modell verwendet wird, grundlegende Einstellungen vornehmen und den Sender mit dem Empf&auml;nger binden. An dieser Stelle empfehlen wir, die Spannungswarnungen passend zu dem verwendeten Empf&auml;nger-Akku einzustellen.</span>
<br>
								
<span id="Help_AddNewModel_10_Label">Sie k&ouml;nnen parallel zum Hauptempf&auml;nger bis zu zwei Sub-Empf&auml;nger hinzuf&uuml;gen. Nutzen Sie diese als zus&auml;tzliche, vollwertige Empf&auml;nger oder auch, um zus&auml;tzliche Servosteckpl&auml;tze zu erhalten.</span>
								
<table>
									
<tr>
										
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
										<td><span id="Help_AddNewModel_11_Label">ACHTUNG: Nur der Hauptempf&auml;nger sendet Telemetrie- und zus&auml;tzliche Sensordaten zur&uuml;ck.</span></td>
									
</tr>
								
</table>
							
</li>
							
<li>
								
<p id="Help_AddNewModel_12_Label">Schritt 4: Servo-Konfiguration - In diesem Men&uuml; k&ouml;nnen alle Einstellungen und Funktionen der Servos konfigurieren werden, zusammen mit den Positionen der Servos im Modell. F&uuml;gen Sie einfach einen neuen Servo einer Funktion hinzu, vergeben Sie einen Namen und stellen Sie den Mittelpunkt plus die Wegbegrenzungen ein.</p>
							
</li>
							
<li>
								
<p id="Help_AddNewModel_13_Label">Schritt 5: Listen&uuml;bersicht der Servo-Konfiguration - In dieser Listen&uuml;bersicht Ihrer Servos werden alle m&ouml;glichen Servosteckpl&auml;tze des von Ihnen hinterlegten Empf&auml;ngers f&uuml;r das Modell aufgelistet. Bitte konfigurieren Sie die Servos, die nicht bereits vorher in der grafischen Ansicht erfasst und konfiguriert wurden.</p>
							
</li>
							
<li>
								
<span id="Help_AddNewModel_14a_Label">Danach wird die Software automatisch Ihr Modell mit diesen Funktionen fertig stellen. Justieren Sie hier nun die Wege f&uuml;r jede Funktion und jeden Servo.</span>
								
<ul>
									
<li id="Help_AddNewModel_14b_Label">Funktion Vorauswahl</li>
									
<li id="Help_AddNewModel_14c_Label">Leitwerksart</li>
									
<li id="Help_AddNewModel_14d_Label">Steuerfl&auml;chenanzahl</li>
								
</ul>
								
<span id="Help_AddNewModel_14e_Label">M&uuml;ssen genau und richtig eingestellt werden, da ein sp&auml;teres &Auml;ndern nicht m&ouml;glich ist.</span>
							
</li>
						
</ul>
						
<br>
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
