<!DOCTYPE html SYSTEM "html">
<html>
	
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
		
<title>9.2.0__CurveEdit_Help</title>
		
<meta content="text/html; charset=utf-8" http-equiv="Content-Type">
		
<link href="/css/bat60.css" rel="Stylesheet" type="text/css">
		
		
<script src="/js/jquery-1.11.0.min.js" type="text/javascript"></script>
		<script src="/js/common.js" type="text/javascript"></script>
		<script defer src="HelpContent.js" type="text/javascript"></script>	
		
		
<style type="text/css">
			
		.content_full_block {
			background:	rgba(255, 255, 255, .9) !important;
			border-style: solid;
			border-width: 4px 4px 4px 4px;
			border-radius: 6px 6px 0px  6px;
			background-color: #fff;
			color: #000;
			font-size: 20px;
			height: 385px;
			overflow: hidden;
			text-align:	justify;
			width: 752px;
		}
		.content_full_block_list{

			margin-top: 0px;
			position: relative;
			width: 720px;
			padding: 0 15px 0 15px;
		}
		ul{
			margin-left: -20px;
		}
		li{
			
		}
		</style>
	
</head>
	
<body>
		
<main>
			
<header>
				
<div class="header_group_icon">
					
<div class="group_icon_help"></div>
				
</div>
				
<div class="header_center">
					
<div class="header_1st_div" id="Help_Page_Label">Hilfe</div>
					
<div class="header_sub_spacer"></div>
					
<div class="header_sub_div" id="Help_Page"></div>
				
</div>
				
<div class="header_battery_value" id="Battery_Value">-- V</div>
				
<div class="header_battery">          
					
<div class="header_battery_image">
						
<div class="battery_spacer"></div>
						
<div class="battery_segment" id="Battery_80"></div>
						
<div class="battery_segment" id="Battery_60"></div>
						
<div class="battery_segment" id="Battery_40"></div>
						
<div class="battery_segment" id="Battery_20"></div>
						
<div class="battery_segment" id="Battery_0"></div>
					
</div>
				
</div>
			
</header>
			
<article>
				
<div class="content_full_block scrollContainerOuterVertical" id="List_Container">
					
<div class="content_full_block_list" id="scrollContainerInnerVertical">
						
<div id="Curve_Edit">
							
<p>
								
<span id="Help_CurveEdit_1_Label">Kurven Editor</span>
<br>
								
<span id="Help_CurveEdit_2_Label">Hier k&ouml;nnen Sie die Kurve mit bis zu 33 Punkten anpassen. Alle Auswahlpunkte werden als kleine graue Punkte auf der Kurve dargestellt. Schwarze Punkte symbolisieren Punkte auf der Kurve, die fixiert wurden. Sollten Sie diese Fixierung aufheben wollen, k&ouml;nnen Sie diese Punkte wieder markieren und bewegen. Ausgew&auml;hlte Punkte werden rot dargestellt und k&ouml;nnen von Ihnen bewegt werden.</span>
<br>
								
<span id="Help_CurveEdit_3_Label">Links sehen Sie die visualisierte Kurve im Koordinatensystem. Der Geber wird auf der horizontalen Achse von links -100% nach rechts +100% dargestellt, und die Function wird auf der vertikalen Achse von Unten -100% nach Oben +100% dargestellt.</span>
<br>
								
<span id="Help_CurveEdit_4_Label">Rechts neben dem Koordinatensystem finden sie mehrere Schaltfl&auml;chen.</span>
							
</p>
							
<ul>
								
<li>
									
<p id="Help_CurveEdit_5_Label">Die komplette Kurve kann vertikal oder horizontal gespiegelt werden.</p>
								
</li>
								
<li>
									
<p id="Help_CurveEdit_6_Label">W&auml;hlen Sie mit dem Button "Vorlage" eine vordefinierte Kurve aus. Auch diese k&ouml;nnen Sie bei Bedarf weiter bearbeiten.</p>
								
</li>
								
<li>
									
<span id="Help_CurveEdit_7a_Label">Sie haben die Wahl zwischen einer allgemein g&uuml;ltigen Kurve oder einer Flugphasen abh&auml;ngigen Kurve. Bei dem gew&auml;hlten Status der Kurve wird das Symbol wei&szlig; hinterlegt.</span>
									
<ul>
										
<li id="Help_CurveEdit_7b_Label">"allgemein G&uuml;ltig (Global)": die Kurve ist f&uuml;r jede Flugphase gleich &ndash; dies ist die "Standard"-Einstellung.</li>
										
<li id="Help_CurveEdit_7c_Label">"Flugphasen abh&auml;ngig (nicht-Global)": die Kurve ist f&uuml;r jede Flugphase individuell anpassbar</li>
									
</ul>
									
<p></p>
								
</li>
								
<li>
									
<p id="Help_CurveEdit_8_Label">Ausw&auml;hlen einzelner Punkte (nur bei grauen Punkten m&ouml;glich). Bewegen Sie den Cursor mittels des Gebers an den Punkt auf der Kurve, den Sie ausw&auml;hlen m&ouml;chten. Nun ber&uuml;hren Sie den Button "Hinzuf&uuml;gen". Der gew&auml;hlte Punkt wird nun rot markiert.</p>
								
</li>
								
<li>
									
<span id="Help_CurveEdit_9_Label">Punkte bewegen (alle roten Punkte). Sie k&ouml;nnen alle rot markierten Punkte bewegen. F&uuml;r eine schnelle Einstellung ber&uuml;hren Sie unabh&auml;ngig von der Position des Gebers einfach die Stelle im Koordinatensystem, zu der sich der Punkt bewegen soll. Die Feinabstimmung erfolgt mittels der "+" und "-" Tasten. Es besteht ebenfalls die M&ouml;glichkeit, mit einem der 6 digitalen Endlos-Drehgeber die Position des roten Punktes zu ver&auml;ndern.</span>
									
<table>
										
<tr>
											
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
											<td><span id="Help_CurveEdit_10_Label">ANMERKUNG:Bitte beachten Sie, dass bei der Nutzung der Endlos Drehgeber sich evtl. Werte &auml;ndern, sollte der gew&auml;hlte Geber bereits als Trimmer einer Funktion zugeordnet sein.</span></td>
										
</tr>
									
</table>
									
<p></p>
								
</li>
								
<li>
									
<span id="Help_CurveEdit_11_Label">Punkte Ausw&auml;hlen (nur bei schwarzen Punkten m&ouml;glich):</span>
									
<ul>
										
<li id="Help_CurveEdit_12_Label">Bewegen Sie den Cursor mittels des Gebers auf den schwarzen Punkt, den Sie ausw&auml;hlen m&ouml;chten. Ber&uuml;hren Sie den "Auswahl" Button und der gew&auml;hlte Punkt wird rot markiert.</li>
										
<li id="Help_CurveEdit_13_Label">Wenn keine roten Punkte auf der Kurve vorhanden sind, k&ouml;nnen Sie mit dem Button "Alle" alle schwarzen Punkte w&auml;hlen. Diese werden dann rot und Sie k&ouml;nnen wie beschrieben die gesamte Kurve bewegen.</li>
										
<li id="Help_CurveEdit_13a_Label">Sie k&ouml;nnen auch direkt auf dem Touchscreen einen schwarzen Punkt ber&uuml;hren. Dieser wird dann ausgew&auml;hlt und wird rot.</li>
									
</ul>
									
<p></p>
								
</li>
								
<li>
									
<span id="Help_CurveEdit_14a_Label">Punkte Abw&auml;hlen (nur bei roten Punkten m&ouml;glich):</span>
									
<ul>
										
<li id="Help_CurveEdit_14b_Label">Bewegen Sie den Geber &uuml;ber den ausgew&auml;hlten roten Punkt. In diesem Moment wird der Button "Abw&auml;hlen" frei gegeben und Sie k&ouml;nnen ihn ber&uuml;hren. Der rote Punkt wird schwarz.</li>
										
<li id="Help_CurveEdit_14c_Label">Alternativ k&ouml;nnen Sie auch den Button "Keiner" ber&uuml;hren, mit dem alle roten Punkte auf der Kurve wieder schwarz werden.</li>
									
</ul>
								
</li>
								
<li>
									
<p id="Help_CurveEdit_15_Label">Punkte L&ouml;schen (nur bei roten Punkten m&ouml;glich): Bewegen Sie den Geber &uuml;ber den ausgew&auml;hlten roten Punkt. Es erscheint ein "L&ouml;schen" Button. Ber&uuml;hren Sie diesen Button und der Punkt wird wieder grau.</p>
								
</li>
							
</ul>
							
<p id="Help_CurveEdit_16_Label">Jedes Mal, wenn eine Kurve ver&auml;ndert wurde, m&uuml;ssen die &Auml;nderungen mit dem Haken best&auml;tigt werden. Erst dann werden sie gespeichert. Wollen Sie die &Auml;nderungen verwerfen, dr&uuml;cken Sie das Kreuz ("X"). Danach k&ouml;nnen Sie mit dem "Seite Verlassen" Symbol die Seite schlie&szlig;en. M&ouml;chten Sie gleichzeitig mehrere Punkte der Kurve bewegen, markieren Sie diese erst alle und ver&auml;ndern dann die Position.</p>
						
</div>
						
<div id="Curve_Edit_ServoSync">
							
<span id="Help_CurveEditServoSync_1_Label">Kurveneditor - Dieser spezielle Kurveneditor behandelt die Abweichungskurve der "Slave" Servos in Relation zur Bewegungskurve der "Master" Servo.</span>
<br>
							
<span id="Help_CurveEditServoSync_2_Label">Der Kurveneditor erlaubt Ihnen dem "Slave-servo" eine Abweichungskurve mit mehreren Punkten (Anzahl der Punkte wird durch die Genauigkeit vorgegeben) einzustellen, links sehen Sie die grafische Darstellung der Abweichung (plus/minus) als Kurve.</span>
<br>
							
<span id="Help_CurveEditServoSync_3_Label">Rechts sehen Sie einige Schaltfl&auml;chen um die Kurve einzustellen. Auch werden Servoposition und falls ein Gizmo vorhanden ist der RX-Strom angezeigt:</span>
							
<ul style="margin-top: 0;">
								
<li>
									
<span id="Help_CurveEditServoSync_4a_Label">Mit den "PLUS" und "MINUS" Buttons bewegen Sie den rot markierten Punkt auf der Kurve. Ebenso k&ouml;nnen Sie entweder mit dem zugeordneten Endlosdrehgeber oder aber auch per Toucheingabe den Punkt verschieben.</span>
									
<table>
										
<tr>
											
<td align="center" valign="top">
<div class="icon_info"></div>
</td>
											<td><span id="Help_CurveEditServoSync_4b_Label">ANMERKUNG:Bitte beachten Sie, dass bei der Nutzung der Endlos Drehgeber sich evtl. Werte &auml;ndern, sollte der gew&auml;hlte Geber bereits als Trimmer einer Funktion zugeordnet sein.</span></td>
										
</tr>
									
</table>
								
</li>
								
<li id="Help_CurveEditServoSync_5_Label">Mit dem "VORHERIGER" und "N&Auml;CHSTER" Button k&ouml;nnen Sie den Punkt ausw&auml;hlen den Sie bewegen m&ouml;chten. Er ist dann rot markiert. Die Servos der Gruppe bewegen Sich dann auch automatisch zu der Position des Punktes.</li>
								
<li id="Help_CurveEditServoSync_6_Label">Mit dem "ALLE" Button markieren Sie alle Punkte der Kurve und somit bewegen Sie die komplette Kurve.</li>
							
</ul>
							
<p id="Help_CurveEditServoSync_7_Label">Kurven&auml;nderungen k&ouml;nnen Sie mit Hilfe des "KREUZ" Buttons verwerfen, genauso m&uuml;ssen Sie jede &Auml;nderung mit dem "HAKEN" Button zuerst best&auml;tigen bevor Sie das Men&uuml; verlassen k&ouml;nnen.</p>	
						
</div>
					
</div>
				
</div>
			
</article>
			
<footer>
				
<div class="black_bar"></div>
				
<div class="right_button_box">
					
<div class="button_blue round_all" id="Option_Box" style="width: 60px; height: 60px; margin-right: 4px;">
<a class="option_button" draggable="false" href="1.1.0__ModelConfiguration.html" id="Option_Button"></a>
</div>
					
<div id="Navi_Box">
						
<div class="button_blue round_all" style="width: 180px; height: 60px;">
<a class="back_button" draggable="false" href="/0.1__HomeScreen.html" id="Navi_Button"></a>
</div>
					
</div>					
				
</div>
			
</footer>
			
<div id="Pop_Up_Blocker"></div>
			
<div id="Pop_Up" style="position: absolute; z-index: 1000;"></div>
		
</main>
		
		
	
</body>

</html>
